## 📦 Terraform Plan Output

```hcl
module.app.data.archive_file.lambda_ecr_listener_zip: Reading...
module.app.data.archive_file.forward_logs_zip: Reading...
module.app.data.archive_file.lambda_ecr_listener_zip: Read complete after 0s [id=b808981c67a08fb6e4401a517cd171ea749e32ee]
module.app.data.archive_file.forward_logs_zip: Read complete after 0s [id=f776745e62cd8eb36989a0e24d6e7244e5dae794]
module.app.aws_cloudwatch_event_rule.ecr_latest_image_push: Refreshing state... [id=ecr-latest-image-push-dev]
module.app.aws_ecs_cluster.app1: Refreshing state... [id=arn:aws:ecs:us-west-2:341795649416:cluster/app1-dev-cluster]
module.app.module.alb.data.aws_partition.current: Reading...
module.app.aws_sqs_queue.analytics_events: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/341795649416/analytics-events-queue-dev]
module.app.aws_ecr_repository.ecr: Refreshing state... [id=ecr-kapset-dev]
module.app.aws_iam_role.ec2_role: Refreshing state... [id=ec2-ecr-access-role-dev]
module.app.aws_cloudwatch_log_group.alb_logs: Refreshing state... [id=/alb/access-logs/dev]
module.app.aws_iam_role.forward_logs_role: Refreshing state... [id=alb-logs-forward-role-dev]
module.app.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b5cda87224fbb9fc]
module.app.aws_iam_role.lambda_restart_role: Refreshing state... [id=lambda-ecr-image-watcher-dev]
module.app.module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.aws_iam_role.analytics_lambda_role: Refreshing state... [id=analytics-lambda-role-dev]
module.app.data.aws_iam_policy_document.ecs_assume_role: Reading...
module.app.data.aws_iam_policy_document.ecs_assume_role: Read complete after 0s [id=1077804475]
module.app.aws_api_gateway_rest_api.analytics_api: Refreshing state... [id=psk9rupz85]
module.app.aws_iam_role.ecs_task_execution: Refreshing state... [id=app1-dev-ecs-execution-role]
module.app.aws_iam_role_policy_attachment.ecr_access: Refreshing state... [id=ec2-ecr-access-role-dev-20250618152548540700000002]
module.app.aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-ecr-access-profile-dev]
module.app.aws_iam_role_policy_attachment.ssm_core: Refreshing state... [id=ec2-ecr-access-role-dev-20250618152548533600000001]
module.app.aws_iam_role_policy.forward_logs_policy: Refreshing state... [id=alb-logs-forward-role-dev:terraform-20250618152548706700000003]
module.app.aws_lambda_function.forward_logs: Refreshing state... [id=forward-alb-logs-dev]
module.app.aws_iam_role_policy.lambda_restart_policy: Refreshing state... [id=lambda-ecr-image-watcher-dev:terraform-20250618152548790700000004]
module.app.aws_lambda_function.ecr_listener: Refreshing state... [id=ecr_image_listener-dev]
module.app.aws_iam_role_policy.analytics_lambda_policy: Refreshing state... [id=analytics-lambda-role-dev:terraform-2025061815261495940000000c]
module.app.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=ecr-kapset-dev]
module.app.aws_iam_role_policy_attachment.ecs_task_execution_attach: Refreshing state... [id=app1-dev-ecs-execution-role-20250618152548908400000005]
module.app.aws_api_gateway_resource.analytics_stats_resource: Refreshing state... [id=87xiy7]
module.app.aws_api_gateway_resource.init_analytics_db_resource: Refreshing state... [id=32mle1]
module.app.aws_api_gateway_resource.analytics_resource: Refreshing state... [id=4lucfe]
module.app.aws_ecs_task_definition.app1: Refreshing state... [id=app1-dev-task]
module.app.aws_api_gateway_method.analytics_post_method: Refreshing state... [id=agm-psk9rupz85-4lucfe-POST]
module.app.aws_api_gateway_method.analytics_get_method: Refreshing state... [id=agm-psk9rupz85-4lucfe-GET]
module.app.aws_api_gateway_method.analytics_stats_get_method: Refreshing state... [id=agm-psk9rupz85-87xiy7-GET]
module.app.aws_api_gateway_method.init_analytics_db_post_method: Refreshing state... [id=agm-psk9rupz85-32mle1-POST]
module.app.aws_lambda_permission.allow_s3_trigger: Refreshing state... [id=AllowExecutionFromS3]
module.app.aws_lambda_permission.eventbridge_invoke_lambda: Refreshing state... [id=AllowExecutionFromEventBridge_ECRPush]
module.app.aws_cloudwatch_event_target.trigger_lambda_on_image_push: Refreshing state... [id=ecr-latest-image-push-dev-ECRImagePushTarget]
module.app.aws_s3_bucket_notification.alb_logs_to_lambda: Refreshing state... [id=alb-access-logs-storage-for-mamkindevops-dev-1]
module.app.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07584f8fad72ab5e2]
module.app.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-007baee42820e2142]
module.app.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-066465493e0199217]
module.app.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0acfb93fd693f15a1]
module.app.aws_security_group.lambda_db_sg: Refreshing state... [id=sg-0f217261953ac172f]
module.app.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-055d84aa90c28d1ee]
module.app.module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0ff25d93201755e1d]
module.app.module.alb.aws_lb_target_group.this["app"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app1-d20250618152603548000000009/ec135c95b05f9185]
module.app.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cae3195ea409355a]
module.app.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b8bc3273ce6d80db]
module.app.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03779d1696876a18c]
module.app.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f9326bcfdcf07cb7]
module.app.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0aaaccff348da7ce1]
module.app.aws_security_group.rds_sg: Refreshing state... [id=sg-05b881b290fd98263]
module.app.module.alb.aws_vpc_security_group_ingress_rule.this["http"]: Refreshing state... [id=sgr-0dc2bccf94b4537a5]
module.app.aws_security_group.app_sg: Refreshing state... [id=sg-03d9c6be6e332510a]
module.app.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03779d1696876a18c1080289494]
module.app.module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-05207b40bda7e6961]
module.app.aws_security_group.ecs_service: Refreshing state... [id=sg-0c2c1cf6892809355]
module.app.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c93d93c3fcad68f3]
module.app.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0244bcd055e624910]
module.app.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03213660887f97e16]
module.app.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-081eb0496d13bd805]
module.app.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:loadbalancer/app/app1-alb-dev/893ccbe44c922d42]
module.app.aws_db_subnet_group.analytics_rds_subnet_group: Refreshing state... [id=analytics-rds-subnet-group-dev]
module.app.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09dea7e4af3aaccea]
module.app.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f9326bcfdcf07cb71080289494]
module.app.module.alb.aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:listener/app/app1-alb-dev/893ccbe44c922d42/b7cb72c176bae554]
module.app.aws_db_instance.analytics_db: Refreshing state... [id=db-TJSQWWVCUVKXJA6H3ZSZXN73TE]
module.app.aws_ecs_service.app1: Refreshing state... [id=arn:aws:ecs:us-west-2:341795649416:service/app1-dev-cluster/app1-dev-svc]
module.app.aws_lambda_function.analytics_stats_lambda: Refreshing state... [id=analytics-stats-dev]
module.app.aws_lambda_function.analytics_sqs_consumer_lambda: Refreshing state... [id=analytics-sqs-consumer-dev]
module.app.aws_lambda_function.analytics_data_getter_lambda: Refreshing state... [id=analytics-data-getter-dev]
module.app.aws_lambda_function.analytics_db_init_lambda: Refreshing state... [id=analytics-db-init-dev]
module.app.aws_lambda_function.analytics_lambda: Refreshing state... [id=analytics-event-handler-dev]
module.app.aws_lambda_permission.allow_api_gateway_invoke_analytics_get: Refreshing state... [id=AllowExecutionFromAPIGatewayAnalyticsGet]
module.app.aws_api_gateway_integration.analytics_get_integration: Refreshing state... [id=agi-psk9rupz85-4lucfe-GET]
module.app.aws_lambda_permission.allow_api_gateway_invoke_analytics_stats: Refreshing state... [id=AllowExecutionFromAPIGatewayAnalyticsStats]
module.app.aws_api_gateway_integration.analytics_stats_integration: Refreshing state... [id=agi-psk9rupz85-87xiy7-GET]
module.app.aws_lambda_permission.allow_api_gateway_invoke_init_analytics_db: Refreshing state... [id=AllowExecutionFromAPIGatewayInitAnalyticsDb]
module.app.aws_api_gateway_integration.init_analytics_db_integration: Refreshing state... [id=agi-psk9rupz85-32mle1-POST]
module.app.aws_lambda_event_source_mapping.analytics_sqs_trigger: Refreshing state... [id=33117b9f-9154-4a2b-aa7d-46f92fd9f25c]
module.app.aws_lambda_permission.allow_api_gateway_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.app.aws_api_gateway_integration.analytics_integration: Refreshing state... [id=agi-psk9rupz85-4lucfe-POST]
module.app.aws_api_gateway_deployment.analytics_api_deployment: Refreshing state... [id=szyccy]
module.app.aws_api_gateway_stage.analytics_api_stage: Refreshing state... [id=ags-psk9rupz85-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.aws_ecs_service.app1 will be updated in-place
  ~ resource "aws_ecs_service" "app1" {
        id                                 = "arn:aws:ecs:us-west-2:341795649416:service/app1-dev-cluster/app1-dev-svc"
        name                               = "app1-dev-svc"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:341795649416:task-definition/app1-dev-task:4" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app.aws_ecs_task_definition.app1 must be replaced
-/+ resource "aws_ecs_task_definition" "app1" {
      ~ arn                      = "arn:aws:ecs:us-west-2:341795649416:task-definition/app1-dev-task:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:341795649416:task-definition/app1-dev-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - essential      = true
                  ~ image          = "341795649416.dkr.ecr.us-west-2.amazonaws.com/ecr-kapset-dev:v1.0.8" -> "341795649416.dkr.ecr.us-west-2.amazonaws.com/ecr-kapset-dev:dev-latest"
                  - mountPoints    = []
                    name           = "app1"
                  ~ portMappings   = [
                      ~ {
                          - hostPort      = 8000
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                    # (1 unchanged attribute hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "app1-dev-task" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```